tap "homebrew/services"

# Development tools
brew "awscli"
brew "gh"
brew "node"
brew "nvm"
brew "yarn"

# Zsh
brew "zsh"
brew "zsh-autosuggestions"

# Updated versions of utilities
brew "bash"
brew "less"
brew "nano"
brew "vim"

# Other useful tools
brew "bat"
brew "git"
brew "git-delta"
brew "gzip"
brew "jq"
brew "pstree"
brew "python"
brew "rsync"
brew "tree"
brew "youtube-dl"
brew "wget"

# Silly programs
brew "cowsay"
brew "fortune"
brew "lolcat"

# Cask programs
# cask "spotify"
# cask "iterm2"
# cask "slack"
# cask "google-chrome"
# cask "firefox"
# cask "vlc"
# cask "imageoptim"
# cask "mactex"
# cask "zoomus"
# cask "clipy"

# GNU utils instead of MacOS equivalents
# I'm not sure how many of these I actually need,
# so I'm leaving them commented for now
# (also the tools' names get prefixed with a "g")
# brew "binutils"
# brew "coreutils"
# brew "findutils"
# brew "diffutils"
# brew "gnu-indent"
# brew "gnu-sed"
# brew "ed"
# brew "gnu-tar"
# brew "grep"
# brew "gnu-which"
# brew "gawk"
# brew "gzip"
# brew "watch"
# brew "gnutls"
# brew "wget"
# brew "curl"
# brew "make"
